set search_path "/synopsys/GPDK/SAED_EDK90nm/Digital_Standard_Cell_Library/synopsys/models"
set link_library "saed90nm_max.db"
set target_library "saed90nm_max.db"
set symbol_library "saed90nm_max.db"
analyze -library WORK -format verilog {/ugrad/dolsen/Git/ECE524/Lab1/c17/c17.v}
elaborate c17 -library WORK
write -hierarchy -format verilog -output /ugrad/dolsen/Git/ECE524/Lab1/c17/c17Gen_dc_pre.v
link
compile -exact_map
write -hierarchy -format verilog -output /ugrad/dolsen/Git/ECE524/Lab1/c17/c17Map_dc_pre.v
report_area > /ugrad/dolsen/Git/ECE524/Lab1/c17/areaC17_dc_pre.txt
report_timing > /ugrad/dolsen/Git/ECE524/Lab1/c17/timingC17_dc_pre.txt
report_power > /ugrad/dolsen/Git/ECE524/Lab1/c17/powerC17_dc_pre.txt
report_const > /ugrad/dolsen/Git/ECE524/Lab1/c17/constC17_dc_pre.txt
report_dft_drc_violations > /ugrad/dolsen/Git/ECE524/Lab1/c17/violationsC17_dc_pre.txt

