set search_path "/synopsys/GPDK/SAED_EDK90nm/Digital_Standard_Cell_Library/synopsys/models"
set link_library "saed90nm_max.db"
set target_library "saed90nm_max.db"
set symbol_library "saed90nm_max.db"
analyze -library WORK -format verilog {/ugrad/dolsen/Git/ECE524/Lab1/c17.v}
elaborate c17 -architecture BEHAVE -library WORK
write -hierarchy -format verilog -output /ugrad/dolsen/Git/ECE524/Lab1/c17Gen.v
link
compile -exact_map
write -hierarchy -format verilog -output /ugrad/dolsen/Git/ECE524/Lab1/c17Map.v
report_area > areaC17.txt
remove_design c17
